Config/Documents/ПередачаГруппОбъектовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаГруппОбъектовОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажиВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписанияСБухУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПередачиОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМОПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыОперацийПередачиОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПередачиОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаСобственныхОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаКапвложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСобственныхОСОперУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСПолученныхВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСнаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСвУправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСвПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСОперУчетВУправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСОперУчетАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСОперУчетВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияСобственныхОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияСобственныхОСОперУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщикуСоСчета106</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПередачаГруппОбъектовОС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ТребуетсяПересчитатьСуммы; 
&НаКлиенте
Перем ТребуетсяПерезаполнитьСчета;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект,
		"ОсновныеСредстваПодборОС,ВыбратьКомиссию,ВыбратьПредседателяКомиссии,СоставКомиссииПодобратьСотрудников");
	
	УправлениеОсновнымиСредствамиКлиентСервер.ЗаполнитьСписокВыбораВидаОперацииДокумента(ТипЗнч(Параметры.Ключ), Элементы.ВидОперации);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");

	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
		ВидОперацииПрежний = Объект.ВидОперации;
	КонецЕсли;
	
	ЗаполнитьТекстПроСчетФактуруСервер();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	ВидОперацииПрежний = Объект.ВидОперации;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
    Оповестить("ДокументыПоУчетуОСИзменение");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	УстановитьДинамическиеДанныеТаблицыОсновныеСредства();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПостоянноДействующиеКомиссии.Форма.ФормаВыбора" Тогда
		УправлениеОсновнымиСредствамиКлиент.УстановитьКомиссиюВДокументОС(ВыбранноеЗначение, Объект, ЭтаФорма);
	ИначеЕсли СтрНачинаетсяС(ИсточникВыбора.ИмяФормы, "Обработка.ПодборОсновныхСредств") Тогда
		ОбработкаВыбораПодбораОсновныхСредствНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СчетФактураВыданный" Тогда
		ЗаполнитьТекстПроСчетФактуруКлиент(Параметр, Источник);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеОсновнымиСредствамиКлиент.ПриОткрытииДокумента173н(ЭтотОбъект, "ПередачаОбъектовОС");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
	 	И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВПользование(Объект.ВидОперации) Тогда
		Объект.ДатаСписанияСБухУчета = Объект.Дата;
	Иначе
		УправлениеОсновнымиСредствамиКлиент.ЗапроситьИзменениеДатыСписанияСБухУчета(Объект);
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ОсновныеСредства.Количество() > 0 
		И ИзменилисьСчетаУчета(ВидОперацииПрежний, Объект.ВидОперации) Тогда
		
		ТекстВопроса = НСтр("ru='При измении вида учета с ""%1"" на ""%2"" необходимо пересчитать балансовые суммы и амортизацию.
			|Пересчитать суммы?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ВидОперацииПрежний, Объект.ВидОперации);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru = 'Пересчитать суммы'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru = 'Не пересчитывать суммы'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Не изменять вид передачи'"));
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросаИзменитьВидОперации", ЭтотОбъект),
			ТекстВопроса, Кнопки,,КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
	ОбработкаВопросаИзменитьВидОперации(КодВозвратаДиалога.Нет, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПриИзменении(Элемент)
	ОбнулитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура КФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(Объект.Организация,
											   Объект.ИФО,
											   Объект.КФО,
											   Объект.Дата,
											   ,
											   Объект.КПС);
	
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	ОбнулитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура КПСПриИзменении(Элемент)
	ОбнулитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	
	Для каждого ТекСтр Из Объект.ОсновныеСредства Цикл
		ПересчитатьНДС(ТекСтр);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПредседателяКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеОсновнымиСредствамиКлиент.ОбработатьВыборПредседателяКомиссии(ЭтаФорма,
																			ВыбранноеЗначение, 
																			СтандартнаяОбработка, 
																			Объект.ДолжностьПредседателяКомиссии,
																			Объект.ФамилияПредседателяКомиссии,
																			Объект.ИмяПредседателяКомиссии,
																			Объект.ОтчествоПредседателяКомиссии);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСчетФакутраНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтаФорма, СтандартнаяОбработка, "СчетФактураВыданный");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеСредства

&НаСервере
Процедура ОбработкаВыбораПодбораОсновныхСредствНаСервере(Знач ВыбранноеЗначение)
	
	ДобавленныеСтроки = УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(
		Объект.ОсновныеСредства, ВыбранноеЗначение, , "ОсновноеСредство,ИнвентарныйНомер");
	
	УстановитьДинамическиеДанныеТаблицыОсновныеСредства();
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		УправлениеОсновнымиСредствамиКлиентСервер.ПроверитьУстановитьКоличествоОСВСтроке(СтрокаТаблицы);
	КонецЦикла;
	
	РассчитатьСуммыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Организация",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Организация", Объект.Организация);
	УправлениеОсновнымиСредствамиКлиент.ДобавитьОбщиеПараметрыВыбораОсновныхСредствПриВыбытии(
		ПараметрыФормы, Объект.ВидОперации);
	
	ПараметрыФормы.Вставить("ТекущаяСтрока",   Элементы.ОсновныеСредства.ТекущиеДанные.ОсновноеСредство);
	ПараметрыФормы.Вставить("ТребуемыеДанные", "Цена,ИнвентарныйНомер");
	
	ОткрытьФорму("Справочник.ОсновныеСредства.ФормаВыбора", ПараметрыФормы, Элемент);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура")
	 ИЛИ НЕ ВыбранноеЗначение.Свойство("Ссылка") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Свойство("ИнвентарныйНомер") Тогда
		ТекущиеДанные.ИнвентарныйНомер = ВыбранноеЗначение.ИнвентарныйНомер;
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбранноеЗначение.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	ОсновноеСредствоПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеСредствоПриИзмененииНаСервере(Знач ИдентификаторСтроки)

	ТекущиеДанные = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	// Заполним динамические колонки в строке таблицы "Основные средства".
	ДанныеОбъектаОС = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(ТекущиеДанные.ОсновноеСредство, Объект.Ссылка);
	ДанныеОбъектаОС.Вставить("ЗабалансовыйСчет", УправлениеОсновнымиСредствамиПовтИсп.ЗабалансовыйСчетОС(ДанныеОбъектаОС.СчетУчета));
	УстановитьДинамическиеДанныеСтрокиОсновныеСредства(ТекущиеДанные, ДанныеОбъектаОС);
	
	УправлениеОсновнымиСредствамиКлиентСервер.ПроверитьУстановитьКоличествоОСВСтроке(ТекущиеДанные);
	
	// Заполним суммы по данным бухгалтерского учета.
	ПараметрыПолученияОстатков = ПараметрыПолученияОстатков();
	ПараметрыПолученияОстатков.ОсновноеСредство = ТекущиеДанные.ОсновноеСредство;
	Если ЗначениеЗаполнено(ТекущиеДанные.ИнвентарныйНомер) Тогда
		ПараметрыПолученияОстатков.ИнвентарныйНомер = ТекущиеДанные.ИнвентарныйНомер;
	Иначе
		ПараметрыПолученияОстатков.УстанавливатьИнвентарныйНомер = Истина;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаКапвложений Тогда
		ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстаткиКапВложений(ПараметрыПолученияОстатков); 
	Иначе
		ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстатки(ПараметрыПолученияОстатков); 
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ОсновноеСредство",	"ОсновноеСредство");
	ПараметрыЗаполнения.Вставить("ИнвентарныйНомер",	"ИнвентарныйНомер");
	ПараметрыЗаполнения.Вставить("Количество",			"Количество");
	ПараметрыЗаполнения.Вставить("Цена",				"Цена");
	ПараметрыЗаполнения.Вставить("Сумма",				"Сумма");
	ПараметрыЗаполнения.Вставить("СуммаАмортизации",	"СуммаАмортизации");
		
	ПараметрыЗаполнения.Вставить("УстанавливатьИнвентарныйНомер", Истина);
	
	УправлениеОсновнымиСредствами.ЗаполнитьОбъектИзТаблицыОстатков(ТаблицаОстатков, ТекущиеДанные, ПараметрыЗаполнения);

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
		ПараметрыФормы.Отбор.Вставить("Организация", Объект.Организация);
		УправлениеОсновнымиСредствамиКлиент.ДобавитьОбщиеПараметрыВыбораОсновныхСредствПриВыбытии(
			ПараметрыФормы, Объект.ВидОперации);
		
		ПараметрыФормы.Вставить("СтрокаПоиска",		Текст);
		ПараметрыФормы.Вставить("ТребуемыеДанные",	"Цена,ИнвентарныйНомер");
		
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.ОсновныеСредства"), ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
		ПараметрыФормы.Отбор.Вставить("Организация", Объект.Организация);
		УправлениеОсновнымиСредствамиКлиент.ДобавитьОбщиеПараметрыВыбораОсновныхСредствПриВыбытии(
			ПараметрыФормы, Объект.ВидОперации);
		
		ПараметрыФормы.Вставить("СтрокаПоиска",		Текст);
		ПараметрыФормы.Вставить("ТребуемыеДанные",	"Цена,ИнвентарныйНомер");
		
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.ОсновныеСредства"), ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	СписокСостояний = Новый СписокЗначений;
	СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ВведеноВЭксплуатацию"));
	СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ПринятоКУчету"));
	
	ПараметрыОтбора = Новый Структура("Владелец, ОС, ЦМО, Состояние",
										Объект.Организация,
										ТекущиеДанные.ОсновноеСредство,
										Объект.ЦМО,
										СписокСостояний);
	ПараметрыФормы = Новый Структура("Отбор, ТекущаяСтрока, НаДату",
										ПараметрыОтбора,
										ТекущиеДанные.ОсновноеСредство,
										Объект.Дата - 1);
	
	ОткрытьФорму("Справочник.ИнвентарныеНомераОС.ФормаВыбора", ПараметрыФормы, Элемент);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерПриИзменении(Элемент)
	
	ОсновноеСредствоПриИзмененииНаСервере(Элементы.ОсновныеСредства.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	ТекущиеДанные.СуммаАмортизации = Мин(ТекущиеДанные.СуммаАмортизации, ТекущиеДанные.Сумма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Цена = 0;
	Иначе
		ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	КонецЕсли;
	ТекущиеДанные.СуммаАмортизации = Мин(ТекущиеДанные.СуммаАмортизации, ТекущиеДанные.Сумма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	УправлениеОсновнымиСредствамиКлиентСервер.ПроверитьУстановитьКоличествоОСВСтроке(ТекущиеДанные);
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	ТекущиеДанные.СуммаАмортизации = Мин(ТекущиеДанные.СуммаАмортизации, ТекущиеДанные.Сумма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваЦенаПродажиПриИзменении(Элемент)
	ПересчитатьНДС(Элементы.ОсновныеСредства.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСтавкаНДСПриИзменении(Элемент)
	ПересчитатьНДС(Элементы.ОсновныеСредства.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСуммаНДСПриИзменении(Элемент)
	ПересчитатьВсего(Элементы.ОсновныеСредства.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьОС(Команда)
	
	РассчитатьСуммы(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Сначала необходимо выбрать организацию'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект.Организация, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьВыборПредседателяКомиссии(Элементы.ФамилияПредседателяКомиссии, Объект.Организация, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВопросаИзменитьВидОперации(РезультатВопроса, ДополнительныеПараметры) Экспорт

	ТребуетсяПересчитатьСуммы = Ложь;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТребуетсяПересчитатьСуммы = Истина;
	ИначеЕсли РезультатВопроса <> КодВозвратаДиалога.Нет Тогда
		Объект.ВидОперации = ВидОперацииПрежний;
		Возврат;
	КонецЕсли;
	
	ВидОперацииПрежний = Объект.ВидОперации;
	
	ТребуетсяПерезаполнитьСчета = ВидОперацииПрежний = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОСОперУчет")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОСОперУчет");
	
	Если ТребуетсяПерезаполнитьСчета Тогда
		УстановитьДинамическиеДанныеТаблицыОсновныеСредства();
	КонецЕсли;
	
	Если ТребуетсяПересчитатьСуммы Тогда
		РассчитатьСуммы(Ложь);
	КонецЕсли;
	
	УстановитьВидимостьСтраницыЦМОПодразделение(ЭтаФорма, Объект);
	УстановитьОбязательностьЭлементовФормы(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Функция ИзменилисьСчетаУчета(СтарыйВидОперации, НовыйВидОперации)

	Если СтарыйВидОперации = НовыйВидОперации Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ГруппыВидовОпераций = Новый Массив;
	
	ГруппаОпераций = Новый Массив;
	ГруппаОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений"));
	ГруппыВидовОпераций.Добавить(ГруппаОпераций);
	
	ГруппаОпераций = Новый Массив;
	ГруппаОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОСОперУчет"));
	ГруппыВидовОпераций.Добавить(ГруппаОпераций);
	
	ГруппаОпераций = Новый Массив;
	ГруппаОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСПолученныхВПользование"));
	ГруппыВидовОпераций.Добавить(ГруппаОпераций);
	
	ГруппаОпераций = Новый Массив;
	ГруппаОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСнаХранении"));
	ГруппыВидовОпераций.Добавить(ГруппаОпераций);
	
	ГруппаОпераций = Новый Массив;
	ГруппаОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСАренда"));
	ГруппаОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСвПользование"));
	ГруппаОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОС"));
	ГруппыВидовОпераций.Добавить(ГруппаОпераций);
	
	СтарыйИндекс = -1;
	НовыйИндекс = -1;
	ТекущийИндекс = 0;
	Для каждого ГруппаОпераций Из ГруппыВидовОпераций Цикл
	
		Если ГруппаОпераций.Найти(СтарыйВидОперации) <> Неопределено Тогда
			СтарыйИндекс = ТекущийИндекс;
		КонецЕсли;
		Если ГруппаОпераций.Найти(НовыйВидОперации) <> Неопределено Тогда
			НовыйИндекс = ТекущийИндекс;
		КонецЕсли;
		ТекущийИндекс = ТекущийИндекс + 1;
	
	КонецЦикла;
	
	Возврат СтарыйИндекс <> НовыйИндекс;

КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьДинамическиеДанныеТаблицыОсновныеСредства();
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	УстановитьВидимостьСтраницыЦМОПодразделение(ЭтаФорма, Объект);
	УстановитьОбязательностьЭлементовФормы(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма, Объект)

	ДоступностьРеквизитов = ЗначениеЗаполнено(Объект.Организация);
	Форма.Элементы.РеквизитыЛицевогоСчета.Доступность	= ДоступностьРеквизитов;
	Форма.Элементы.Подразделение.Доступность			= ДоступностьРеквизитов;
	Форма.Элементы.ЦМО.Доступность					= ДоступностьРеквизитов;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма, Объект)

	Форма.Элементы.Договор.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьСтраницыЦМОПодразделение(Форма, Объект)

	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВПользование(Объект.ВидОперации) Тогда
		Форма.Элементы.ГруппаЦМОПодразделениеПолучательСтраницы.ТекущаяСтраница = Форма.Элементы.СтраницаЦМОПодразделениеПолучатель;
	Иначе
		Форма.Элементы.ГруппаЦМОПодразделениеПолучательСтраницы.ТекущаяСтраница = Форма.Элементы.СтраницаЦМОПодразделениеПолучательПустая;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОбязательностьЭлементовФормы(Форма, Объект)

	Элементы = Форма.Элементы;

	КПСОбязательно 				= Ложь;
	ПодразделениеОбязательно	= Ложь;
	КонтрагентОбязательно		= Ложь;
	ЦМООбязательно				= Истина;
	
	СвойстваСчета = УправлениеОсновнымиСредствамиКлиентСервер.ПолучитьПризнакиУчетаСчетаПоВидуПередачиОС(
						Объект.ВидОперации, ЦМООбязательно, КонтрагентОбязательно);
	Если СвойстваСчета <> Неопределено Тогда
		КПСОбязательно 				= СвойстваСчета.УчетПоКПС;
		ПодразделениеОбязательно	= ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям") И СвойстваСчета.УчетПоПодразделениям;
	КонецЕсли;
	
	Если КПСОбязательно Тогда
		Элементы.КПС.АвтоОтметкаНезаполненного  = Истина;
		Элементы.КПС.ОтметкаНезаполненного		= НЕ ЗначениеЗаполнено(Объект.КПС);
	Иначе
		Элементы.КПС.АвтоОтметкаНезаполненного  = Ложь;
		Элементы.КПС.ОтметкаНезаполненного		= Ложь;
	КонецЕсли;
	Если ПодразделениеОбязательно Тогда
		Элементы.Подразделение.АвтоОтметкаНезаполненного	= Истина;
		Элементы.Подразделение.ОтметкаНезаполненного		= НЕ ЗначениеЗаполнено(Объект.Подразделение);
	Иначе
		Элементы.Подразделение.АвтоОтметкаНезаполненного	= Ложь;
		Элементы.Подразделение.ОтметкаНезаполненного		= Ложь;
	КонецЕсли;
	Если КонтрагентОбязательно Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного	= Истина;
		ЭЛементы.Контрагент.ОтметкаНезаполненного		= Не ЗначениеЗаполнено(Объект.Контрагент);
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного	= Ложь;
		ЭЛементы.Контрагент.ОтметкаНезаполненного		= Ложь;
	КонецЕсли;		
	Если ЦМООбязательно Тогда
		Элементы.ЦМО.АвтоОтметкаНезаполненного	= Истина;
		ЭЛементы.ЦМО.ОтметкаНезаполненного		= Не ЗначениеЗаполнено(Объект.ЦМО);
	Иначе
		Элементы.ЦМО.АвтоОтметкаНезаполненного	= Ложь;
		ЭЛементы.ЦМО.ОтметкаНезаполненного		= Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстПроСчетФактуруКлиент(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения)
	
	Перем ЗначениеСвойства;
	
	ЭтотДокументЯвляетсяОснованием = (ТипЗнч(ПараметрОбработкиОповещения) = Тип("Структура")
		И ПараметрОбработкиОповещения.Свойство("ДокументыОснования", ЗначениеСвойства)
		И ЗначениеСвойства.Найти(Объект.Ссылка) <> Неопределено);
	
	Если ЭтотДокументЯвляетсяОснованием Тогда
		ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения = Неопределено, ИсточникОбработкиОповещения = Неопределено)
	
	УчетНДС.ЗаполнитьТекстПроСчетФактуру(ЭтаФорма, ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДинамическиеДанныеТаблицыОсновныеСредства()
	
	МассивОбъектовОС = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	ДанныеОбъектовОС = УправлениеОсновнымиСредствами.ДанныеОбъектовОС(МассивОбъектовОС, Объект.Ссылка);
	
	Для каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		
		ДанныеОбъектаОС = ДанныеОбъектовОС.Найти(СтрокаТаблицы.ОсновноеСредство, "ОсновноеСредство");
		Если ДанныеОбъектаОС <> Неопределено Тогда
			УстановитьДинамическиеДанныеСтрокиОсновныеСредства(СтрокаТаблицы, ДанныеОбъектаОС);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДинамическиеДанныеСтрокиОсновныеСредства(СтрокаТаблицы, ДанныеОбъектаОС)
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеОбъектаОС, "ГрупповойУчет,ВидНФА");
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаСобственныхОСОперУчет
	 ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаОСОперУчетАренда
	 ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаОСОперУчетВПользование Тогда
		СтрокаТаблицы.СчетУчета = ДанныеОбъектаОС.ЗабалансовыйСчет;
		СтрокаТаблицы.ЭтоСчетБиблиотеки = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаКапвложений Тогда
		СтрокаТаблицы.СчетУчета = ДанныеОбъектаОС.СчетВложений;
		СтрокаТаблицы.ЭтоСчетБиблиотеки = Ложь;
	Иначе
		СтрокаТаблицы.СчетУчета = ДанныеОбъектаОС.СчетУчета;
		СтрокаТаблицы.ЭтоСчетБиблиотеки = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоБиблиотечныйФонд(
			СтрокаТаблицы.СчетУчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("КФО");
	Если ИспользоватьУчетПоИФО Тогда
		СтруктураРеквизитов.Вставить("ИФО");
	КонецЕсли;
	Если Элементы.КПС.ОтметкаНезаполненного Тогда
		СтруктураРеквизитов.Вставить("КПС");
	КонецЕсли;
	Если Элементы.ЦМО.ОтметкаНезаполненного Тогда
		СтруктураРеквизитов.Вставить("ЦМО", "МОЛ/Место хранения");
	КонецЕсли;
	Если ИспользоватьУчетПоПодразделениям Тогда
		Если Элементы.Подразделение.ОтметкаНезаполненного Тогда
			СтруктураРеквизитов.Вставить("Подразделение");
		КонецЕсли;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСПолученныхвПользование")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСнаХранении") Тогда
		СтруктураРеквизитов.Вставить("Контрагент");
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ОбнулитьСуммы()

	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		СтрокаТаблицы.Сумма = 0;
		СтрокаТаблицы.СуммаАмортизации = 0;
		СтрокаТаблицы.Цена = 0;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммы(СообщатьОбОшибках = Истина)

	Отказ = ОбщегоНазначенияБГУКлиентСервер.ПроверитьЗаполнениеРеквизитов(
		СтруктураПроверяемыхРеквизитов(), Объект, СообщатьОбОшибках);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммыНаСервере();

КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыНаСервере()
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ПараметрыПолученияОстатков = ПараметрыПолученияОстатков();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Объект.ОсновныеСредства, ПараметрыПолученияОстатков.ТаблицаОС);
	ПараметрыПолученияОстатков.ТаблицаОС.ЗаполнитьЗначения(Объект.КФО, "КФО");
	ПараметрыПолученияОстатков.ТаблицаОС.ЗаполнитьЗначения(Объект.КПС, "КПС");
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаКапвложений Тогда
		ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстаткиКапВложений(ПараметрыПолученияОстатков); 
	Иначе
		ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстатки(ПараметрыПолученияОстатков); 
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ОсновноеСредство",	"ОсновноеСредство");
	ПараметрыЗаполнения.Вставить("ИнвентарныйНомер",	"ИнвентарныйНомер");
	ПараметрыЗаполнения.Вставить("Количество",			"Количество");
	ПараметрыЗаполнения.Вставить("Цена",				"Цена");
	ПараметрыЗаполнения.Вставить("Сумма",				"Сумма");
	ПараметрыЗаполнения.Вставить("СуммаАмортизации",	"СуммаАмортизации");
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоБиблиотечныйФонд(СтрокаТаблицы.СчетУчета) Тогда
			ПараметрыЗаполнения.Вставить("ЭтоБиблиотечныйФонд", Истина);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗаполнения.Вставить("УстанавливатьИнвентарныйНомер", Ложь);
	
	Для каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		УправлениеОсновнымиСредствами.ЗаполнитьОбъектИзТаблицыОстатков(ТаблицаОстатков, СтрокаТаблицы, ПараметрыЗаполнения);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПараметрыПолученияОстатков()
	
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект, Объект.ДатаСписанияСБухУчета);
	ПараметрыПолученияОстатков.ЦМО 				= Объект.ЦМО;
	ПараметрыПолученияОстатков.Подразделение	= Объект.Подразделение;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОСОперУчет")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСОперУчетАренда")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСОперУчетВПользование") Тогда
		ПараметрыПолученияОстатков.ИспользуемыйСчет = "ЗабалансовыйСчет";
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОС") Тогда
		ПараметрыПолученияОстатков.ПолучатьАмортизацию = Истина;
	КонецЕсли;
	
	Возврат ПараметрыПолученияОстатков;

КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация",	Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО",			Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("КФО",			Объект.КФО);
	
	Если Элементы.КПС.АвтоОтметкаНезаполненного Тогда
		ПараметрыПодбора.Отбор.Вставить("КПС", Объект.КПС);
	КонецЕсли;
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений") Тогда
		ПараметрыПодбора.Отбор.Вставить("ЦМО",				Объект.ЦМО);
		ПараметрыПодбора.Отбор.Вставить("Подразделение",	Объект.Подразделение);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ПоказыватьОстатки", Истина);
	ПараметрыПодбора.Вставить("ЕстьИнвентарныйНомер", Истина);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОСОперУчет")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСОперУчетАренда") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСОперУчетВПользование") Тогда
		ПараметрыПодбора.Вставить("ВключатьЗабалансовыеСчета", Истина);
	Иначе
		ПараметрыПодбора.Вставить("ВключатьБалансовыеСчета", Истина);
		Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений") Тогда
			СостоянияОС = Новый СписокЗначений;
			СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ВведеноВЭксплуатацию"));
			СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ПринятоКУчету"));
			ПараметрыПодбора.Отбор.Вставить("Состояние", СостоянияОС);
		КонецЕсли;
	КонецЕсли;
	
	УправлениеОсновнымиСредствамиКлиент.ДобавитьОбщиеПараметрыВыбораОсновныхСредствПриВыбытии(
		ПараметрыПодбора, Объект.ВидОперации);
		
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений") Тогда
		НастройкиВыбора = Новый НастройкиКомпоновкиДанных;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиВыбора.Отбор,
			"СобытиеВПользовании",, ВидСравненияКомпоновкиДанных.НеЗаполнено,, Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ПараметрыПодбора.Вставить("ДополнительныйОтбор", НастройкиВыбора.Отбор);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ТребуемыеДанные", "Цена");
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()

	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);

КонецФункции

&НаКлиенте
Процедура ПересчитатьНДС(ТекущиеДанные)

	СтавкаНДС = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(ТекущиеДанные.СтавкаНДС);
	Если Объект.СуммаВключаетНДС Тогда
		ТекущиеДанные.СуммаНДС = ТекущиеДанные.ЦенаПродажи / (100 + СтавкаНДС) *СтавкаНДС;
	Иначе
		ТекущиеДанные.СуммаНДС = ТекущиеДанные.ЦенаПродажи / 100 *СтавкаНДС;
	КонецЕсли;
	ПересчитатьВсего(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВсего(ТекущиеДанные)

	Если Объект.СуммаВключаетНДС Тогда
		ТекущиеДанные.Всего = ТекущиеДанные.ЦенаПродажи;
	Иначе
		ТекущиеДанные.Всего = ТекущиеДанные.ЦенаПродажи + ТекущиеДанные.СуммаНДС;
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
